/* ----------
 
 
 This file is only needed if you are defining a custom importer attribute.  
 Most importer plugins will not need to do this.  
 Add this file to your project's localized resources if you have defined a custom attribute. 
 
 
 ----------*/

/* Attribute short names That will be presented to the user
 *
 * In the form of
 * Attribute.ShortName
 * "." is not a valid character in an Attribute name.
 * These strings should all be sort and 1 word with no spaces in them.
 */


/* Localized DisplayNames for your custom metadata attributes */
/* The form is:  "myMetadataKey" = "My Metadata Key";    */
/* The name on the left is the name defined in schema.xml */
/* The name on the right is what the user will see */
/* the shortname is a name that users can use in the spotlight search in top right of the computer */
/* eg to look for kOMUserTags files a user would type tag:foobar */

"kOMUserTags" = "Tags";
"kOMUserTags.Description" = "Tags set on a file by a user (Open Meta)";
"kOMUserTags.ShortName" = "tag";

"kOMUserTagTime" = "Tag Time";
"kOMUserTagTime.Description" = "Last time tags were changed on a document (Open Meta)";
"kOMUserTagTime.ShortName" = "tagtime";

"kOMDocumentDate" = "Content Date";
"kOMDocumentDate.Description" = "Date of content creation (Open Meta)";
"kOMDocumentDate.ShortName" = "contentDate,date";

/* Bookmarks should be a list of urls stored as strings */
"kOMBookmarks" = "Bookmarks";
"kOMBookmarks.Description" = "URLs or bookmark names set on a file by a user (Open Meta)";
"kOMBookmarks.ShortName" = "bookmark";

"kOMUserTagApplication" = "Tagging Application";
"kOMUserTagApplication.Description" = "The application that added the tags or other metadata (Open Meta)";
"kOMUserTagApplication.ShortName" = "taggedBy";
